## Cross-Validation

### 一、Loocv (leave-one-out cross-validation)
將數據集分為訓練和測試數據，但只用一個數據做為測試集（每次取出一個數據做為測試集的唯一元素），其他都坐為訓練集，並將此步驟重複N次（N為數據集的數據數量）  

結果就是我們做中訓練了N個模型，每次都能得到一個MSE．而計算最終test MSE則就是將這N個MSE取平均．

**優點**
1. 不受測試集和訓練集劃分方法的影響
2. 用了n-1個數據訓練模型，保證模型的bias更小

**缺點**
1. 計算量過大

### 二、K-fold Cross Validation

每次的測試及將不再只包含一個數據，而是多個，具體數據將根據K的選曲決定，如果K=5，則我們利用五折交叉驗證的步驟就是：
1. 將所有數據集分成五份
2. 不重複地每次取其中一份做測試集，用其他四份做訓練集訓練模型，之後計算該模型在測試集上的MSE
3. 將五次的MSE，取平均得到最後的MSE

## 作業1

試著執行作業程式，觀察三種類型的欄位分別進行( 平均 mean / 最大值 Max / 相異值 nunique ) 中的九次操作會有那些問題? 並試著解釋那些發生Error的程式區塊的原因?

In [13]:
# Only integer or float can be calculated (Mean/Max)
# However, only column age and fare are Numeric Values, the others are
# Categoric Values

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_train = pd.read_csv('data/titanic_train.csv')
df_test = pd.read_csv('data/titanic_test.csv')
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df_test.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [4]:
df_train.shape, df_test.shape

((891, 12), (418, 11))

In [6]:
target = df_train['Survived']
df_train.drop(['Survived'], axis = 1, inplace=True)
df_train.shape

(891, 11)

In [7]:
df = pd.concat([df_train, df_test])
df.shape

(1309, 11)

In [8]:
df.drop(['PassengerId'], axis=1, inplace=True)
df.shape

(1309, 10)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 10 columns):
Pclass      1309 non-null int64
Name        1309 non-null object
Sex         1309 non-null object
Age         1046 non-null float64
SibSp       1309 non-null int64
Parch       1309 non-null int64
Ticket      1309 non-null object
Fare        1308 non-null float64
Cabin       295 non-null object
Embarked    1307 non-null object
dtypes: float64(2), int64(3), object(5)
memory usage: 112.5+ KB

In [11]:
df.describe()

            Pclass          Age        SibSp        Parch         Fare
count  1309.000000  1046.000000  1309.000000  1309.000000  1308.000000
mean      2.294882    29.881138     0.498854     0.385027    33.295479
std       0.837836    14.413493     1.041658     0.865560    51.758668
min       1.000000     0.170000     0.000000     0.000000     0.000000
25%       2.000000    21.000000     0.000000     0.000000     7.895800
50%       3.000000    28.000000     0.000000     0.000000    14.454200
75%       3.000000    39.000000     1.000000     0.000000    31.275000
max       3.000000    80.000000     8.000000     9.000000   512.329200

## 作業2

舉出今天五種類型以外的一種或多種資料類型，你舉出的新類型是否可以歸在三大類中的某些大類? 所以三大類特徵中，哪一大類處理起來應該最複雜?

1. Numeric Data / Categorical Date
2. Character & Strings Data
3. Date Data
4. Boolean Data

Date Data最複雜